In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

df = pd.read_csv(r"C:\Users\HP\Desktop\ASHFA\data_jobs.csv")

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\HP\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [3]:
df.iloc[0]

job_title_short                                       Senior Data Engineer
job_title                Senior Clinical Data Engineer / Principal Clin...
job_location                                                 Watertown, CT
job_via                                                    via Work Nearby
job_schedule_type                                                Full-time
job_work_from_home                                                   False
search_location                                       Texas, United States
job_posted_date                                        2023-06-16 13:44:15
job_no_degree_mention                                                False
job_health_insurance                                                 False
job_country                                                  United States
salary_rate                                                            NaN
salary_year_avg                                                        NaN
salary_hour_avg                                                        NaN
company_name                                          Boehringer Ingelheim
job_skills                                                             NaN
job_type_skills                                                        NaN
Name: 0, dtype: object

# fillna value with median

In [ ]:
median_salary_year = df.salary_year_avg.median()

In [16]:
median_salary_hour = df['salary_hour_avg'].median()

In [20]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [22]:
df_filled.loc[0:3, 'salary_year_avg':'salary_hour_avg']

   salary_year_avg  salary_hour_avg
0         115000.0            45.98
1         115000.0            45.98
2         115000.0            45.98
3         115000.0            45.98

# fill na value with zeros

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        785741 non-null  float64
 13  salary_hour_avg        785741 non-null  float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [47]:
df_cleaned.iloc[:10,11:14]

  salary_rate  salary_year_avg  salary_hour_avg
0         NaN         115000.0            45.98
1         NaN         115000.0            45.98
2         NaN         115000.0            45.98
3         NaN         115000.0            45.98
4         NaN         115000.0            45.98
5         NaN         115000.0            45.98
6         NaN         115000.0            45.98
7         NaN         115000.0            45.98
8         NaN         115000.0            45.98
9         NaN         115000.0            45.98

In [ ]:
fill_values = ['salary_rate', 'salary_year_avg', 'salary_hour_avg']
df_fill = df_cleaned.fillna(0)

df_fill.iloc[:10,11:14]

  salary_rate  salary_year_avg  salary_hour_avg
0           0         115000.0            45.98
1           0         115000.0            45.98
2           0         115000.0            45.98
3           0         115000.0            45.98
4           0         115000.0            45.98
5           0         115000.0            45.98
6           0         115000.0            45.98
7           0         115000.0            45.98
8           0         115000.0            45.98
9           0         115000.0            45.98

# drop duplicates

In [26]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

print("original_len_df: ", len(df_filled))
print("len of drop duplicates df: ", len(df_unique))
print("rows dropped: ",len(df_filled)-len(df_unique))

original_len_df:  785741
len of drop duplicates df:  785640
rows dropped:  101

#drop duplicates by column

In [29]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])

print("original_len_df: ", len(df_filled))
print("len of drop duplicates df: ", len(df_unique))
print("rows dropped: ",len(df_filled)-len(df_unique))

original_len_df:  785741
len of drop duplicates df:  508042
rows dropped:  277699

In [ ]:
# lot of companies sometimes spam job / repetative jobs